{
    "name": "State Of Matter",
    "category": "elake_chemical:cognition",
    "icon": "minecraft:writable_book",
    "pages": [
        {
            "type": "patchouli:text",
            "text": "The states of matter usually refer to the physical forms in which matter exists, mainly including the following three:$(br)$(li)Solid: In the solid state, the molecules, atoms, or ions of matter are closely packed, having a fixed shape and volume. The interaction forces between the particles are strong, causing the particles to vibrate only near fixed positions. Solid materials typically have higher density and hardness."
        },
        {
            "type": "patchouli:text",
            "text": "$(li)Liquid: In the liquid state, the arrangement of molecules, atoms, or ions is more loosely packed than in solids, lacking a fixed shape but having a fixed volume. The interaction forces between the particles are weaker, allowing the particles to move relatively freely, so liquids can flow and adapt to the shape of their container."
        },
        {
            "type": "patchouli:text",
            "text": "$(li)Gas: In the gaseous state, the molecules, atoms, or ions of matter are arranged very loosely, with neither a fixed shape nor a fixed volume. The interaction forces between the particles are very weak, allowing the particles to move freely and fill any container of any shape and volume."
        },
        {
            "type":"patchouli:image",
            "images": [
                "elake_chemical:textures/gui/entries/state_of_matter_en.png"
            ],
            "border": true,
            "text": "Phase Change Diagram of Matter"
        },
        {
            "type": "patchouli:text",
            "text": "$(li)Melting: Solid → Liquid (endothermic)$(li)Freezing: Liquid → Solid (exothermic)$(li)Vaporization (including boiling and evaporation): Liquid → Gas (endothermic)$(li)Liquefaction (compressing volume and lowering temperature): Gas → Liquid (exothermic)$(li)Sublimation: Solid → Gas (endothermic)$(li)Deposition: Gas → Solid (exothermic)"
        },
        {
            "type": "patchouli:text",
            "text": "Note: The terms endothermic and exothermic here refer to heat quantity, not temperature, internal energy, heat value, specific heat capacity, or other thermodynamic concepts. They simply denote the absorption or release of heat. In physics, heat cannot be quantified in terms of how much heat it contains; rather, it can only describe how much heat is absorbed or released."
        }
    ]
}
